/*[ gameinit.c ]*****************************************************/
/*	ＭＭ　マップエディター　ｆｏｒ　ｙｇｓ２ｋ	イニシャライザ		*/
/*------------------------------------------------------------------*/
/*	作者	タケゾー、D.K											*/
/*	作成日	2002/04/18												*/
/*	MAIL	syu@world.interq.or.jp									*/
/*	URL		http://www.interq.or.jp/black/kiku/takezo/				*/
/*																	*/
/*	Copyright (c) 2002 タケゾー All Rights Reserved.				*/
/*-[更新履歴]-------------------------------------------------------*/
/*	2002/04/18		作った。										*/
/*	2002/12/12		改造した。										*/
/********************************************************************/

/*[ DLLのインポート ]************************************************/

/*[ 外部ファイルのインクルード ]*************************************/

/*[ グローバル変数定義 ]*********************************************/

/*[ main ]***********************************************************/
/*	メイン関数														*/
/*-[引数]-----------------------------------------------------------*/
/*	無し															*/
/*-[戻り値]---------------------------------------------------------*/
/*	無し															*/
/********************************************************************/
void main () {

    long x,y;	// 画面サイズ取得用

	// 画面モードを設定
	SetWindow( 1, 660, 420, 8 );
	// ディスプレイ解像度の取得
    GetConstParam( "ScreenSize", &x, &y );
	// Windowを画面中央に設定
	SetConstParam( "WindowPos",
				   (x - 660 +  8) / 2,
				   (y - 380 + 25) / 2 );

	// 各種定数値設定
	SetConstParam( "Caption" , "マップエディター　ｆｏｒ　ｙｇｓ２ｋ" ); 		// キャプション
	SetConstParam( "TextLayerMax",   64);						// MAX Textlayer
	SetConstParam( "PlaneMax",      128);						// MAX Plane
	SetConstParam( "SoundMax",      128);						// MAX Sound
	SetConstParam( "GameTimeMax",    16);						// MAX Timer
	SetConstParam( "StringMax",      32);						// MAX String
	SetConstParam( "StringLength",  512);						// MAX String Byte
	SetConstParam( "EnablePause" ,    1);
	SetConstParam( "EnableMultiApp" , 1);						// 複数起動

	return;
}
